In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [ ]:
import pandas as pd
import numpy as np
import nltk
from nltk.corpus import stopwords
from nltk.tokenize import RegexpTokenizer
from nltk.stem import WordNetLemmatizer
from nltk.stem.porter import PorterStemmer
import string

df = pd.read_csv('/content/drive/My Drive/Final_stack.csv')
df.head()

  Category  ...          Date_posted
0      sql  ...                  NaN
1      sql  ...    Jul 4 '12 at 1:53
2      sql  ...   Apr 21 '11 at 7:56
3      sql  ...  Oct 12 '11 at 19:42
4      sql  ...  Jan 16 '09 at 18:14

[5 rows x 7 columns]

In [ ]:
df.shape

(708865, 7)

In [ ]:
df.columns

Index(['Category', 'Topics', 'Content', 'Tag', 'Votes', 'Number_of_Answers',
       'Date_posted'],
      dtype='object')

In [ ]:
df.index

RangeIndex(start=0, stop=708865, step=1)

In [ ]:
df.isnull().sum()

Category                 0
Topics                   0
Content                  0
Tag                      0
Votes                    0
Number_of_Answers    99178
Date_posted            920
dtype: int64

In [ ]:
# df = df.dropna(axis=0, subset=['Tag'])
import numpy as np
df = df.replace(np.nan, '', regex=True)
df.head()

  Category  ...          Date_posted
0      sql  ...
1      sql  ...    Jul 4 '12 at 1:53
2      sql  ...   Apr 21 '11 at 7:56
3      sql  ...  Oct 12 '11 at 19:42
4      sql  ...  Jan 16 '09 at 18:14

[5 rows x 7 columns]

In [ ]:
df['Topics']=df['Topics'].str.replace("\n","")
df['Topics']=df['Topics'].str.replace("\t"," ")
df['Topics']=df['Topics'].str.strip(" ")

In [ ]:
# Remove all the punctuations

def remove_punct(text):
    no_punct="".join((c for c in text if c not in string.punctuation))
    return no_punct

df['text']=df['Topics'].apply(lambda x:remove_punct(x))
# df['Post']=df['Post'].apply(lambda x:remove_punct(x))
df.head()

  Category  ...                                               text
0      sql  ...             How can I prevent SQL injection in PHP
1      sql  ...  When to use single quotes double quotes and ba...
2      sql  ...  SQL injection that gets around mysqlrealescape...
3      sql  ...  SQL select only rows with max value on a colum...
4      sql  ...  Simulating groupconcat MySQL function in Micro...

[5 rows x 8 columns]

In [ ]:
df['text']=df['Topics'].str.lower()
df.head()

  Category  ...                                               text
0      sql  ...            how can i prevent sql injection in php?
1      sql  ...  when to use single quotes, double quotes, and ...
2      sql  ...  sql injection that gets around mysql_real_esca...
3      sql  ...  sql select only rows with max value on a colum...
4      sql  ...  simulating group_concat mysql function in micr...

[5 rows x 8 columns]

In [ ]:
#Replace string with regular expressions

tokenizer=RegexpTokenizer(r'\w+')

df['text']=df['text'].apply(lambda x:tokenizer.tokenize(x.lower()))
# df['Post']=df['Post'].apply(lambda x:tokenizer.tokenize(x.lower()))
df.head()

  Category  ...                                               text
0      sql  ...    [how, can, i, prevent, sql, injection, in, php]
1      sql  ...  [when, to, use, single, quotes, double, quotes...
2      sql  ...  [sql, injection, that, gets, around, mysql_rea...
3      sql  ...  [sql, select, only, rows, with, max, value, on...
4      sql  ...  [simulating, group_concat, mysql, function, in...

[5 rows x 8 columns]

In [ ]:
# Remove common stop words
import nltk
nltk.download('stopwords')
def remove_stop(text):
    w=[]
    for c in text:
        if c not in stopwords.words('english'):
            w.append(c)
    return w

df['text']=df['text'].apply(lambda x:remove_stop(x))
# df['Post']=df['Post'].apply(lambda x:remove_stop(x))
df.head()

[nltk_data] Downloading package stopwords to /root/nltk_data...
[nltk_data]   Unzipping corpora/stopwords.zip.

  Category  ...                                               text
0      sql  ...                     [prevent, sql, injection, php]
1      sql  ...  [use, single, quotes, double, quotes, backtick...
2      sql  ...  [sql, injection, gets, around, mysqlrealescape...
3      sql  ...  [sql, select, rows, max, value, column, duplic...
4      sql  ...  [simulating, groupconcat, mysql, function, mic...

[5 rows x 8 columns]

In [ ]:
# Convert words to base form
nltk.download('wordnet')
lemmatizer=WordNetLemmatizer()

def word_lem(text):
    lem_text=[lemmatizer.lemmatize(i) for i in text]
    return lem_text

df['text']=df['text'].apply(lambda x:word_lem(x))
# df['Post']=df['Post'].apply(lambda x:word_lem(x))
df.head()

[nltk_data] Downloading package wordnet to /root/nltk_data...
[nltk_data]   Unzipping corpora/wordnet.zip.

  Category  ...                                               text
0      sql  ...                     [prevent, sql, injection, php]
1      sql  ...  [use, single, quote, double, quote, backticks,...
2      sql  ...  [sql, injection, get, around, mysqlrealescapes...
3      sql  ...  [sql, select, row, max, value, column, duplicate]
4      sql  ...  [simulating, groupconcat, mysql, function, mic...

[5 rows x 8 columns]

In [ ]:
# Convert words to base stem

stemmer=PorterStemmer()

def word_stemmer(text):
    stext=" ".join([stemmer.stem(i) for i in text])
    return stext

df['text']=df['text'].apply(lambda x:word_stemmer(x))
# df['Post']=df['Post'].apply(lambda x:word_stemmer(x))
df.head()

  Category  ...                                               text
0      sql  ...                             prevent sql inject php
1      sql  ...           use singl quot doubl quot backtick mysql
2      sql  ...           sql inject get around mysqlrealescapestr
3      sql  ...              sql select row max valu column duplic
4      sql  ...  simul groupconcat mysql function microsoft sql...

[5 rows x 8 columns]

In [ ]:
def joiner(text):
    stext=" ".join([i for i in text])
    return stext

df['text']=df['text'].apply(lambda x:joiner(x))
df.head()

  Category  ...                                               text
0      sql  ...             how can i prevent sql injection in php
1      sql  ...  when to use single quotes double quotes and ba...
2      sql  ...  sql injection that gets around mysql_real_esca...
3      sql  ...  sql select only rows with max value on a colum...
4      sql  ...  simulating group_concat mysql function in micr...

[5 rows x 8 columns]

In [ ]:
# Export output

df.to_csv('versa.csv', index=False)

In [ ]:
# df['text']=row['Title']+' '+row['Post']
    
#     print(row['word_list'])
# df['word_list'] = df['word_list'].str.strip().str.replace('   ', ' ').str.replace('  ', ' ')
# df=df[['Category','Tag','Votes','word_list']]

# df.head()

In [ ]:
# df=df[["Title","Post","Categories","Tags"]]
# df['text']=df['Title']+df['Post']
# df=df[["Topics","text","Tags"]]
df=df[["Topics","text","Category","Tag"]]
df['Category']=df['Category'].apply(lambda x:tokenizer.tokenize(x.lower()))
df['Category']=df['Category'].apply(lambda x:joiner(x))

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
df.head()

                                              Topics  ...                                                Tag
0            How can I prevent SQL injection in PHP?  ...  ['php', 'mysql', 'sql', 'security', 'sql-injec...
1  When to use single quotes, double quotes, and ...  ...                         ['mysql', 'sql', 'quotes']
2  SQL injection that gets around mysql_real_esca...  ...  ['php', 'mysql', 'sql', 'security', 'sql-injec...
3  SQL select only rows with max value on a colum...  ...  ['mysql', 'sql', 'aggregate-functions', 'great...
4  Simulating group_concat MySQL function in Micr...  ...  ['sql', 'sql-server', 'sql-server-2005', 'stri...

[5 rows x 4 columns]

In [ ]:
df['Categories']=df['Categories'].str.replace(", ",",")
df['Tags']=df['Tags'].str.replace(", ",",")
df['Categories']=df['Categories'].str.lower()

In [ ]:
dic={}
for i in df['Categories']:
    if i not in dic.keys():
        dic[i]=1
    else:
        dic[i]+=1
dic

In [ ]:
df['Tags']=df['Tags'].str.replace(" ","")

In [ ]:
df=df[df['Tags'] != 'português']
df=df[df['Tags'] != 'español']
df=df[df['Tags'] != 'français']

In [ ]:
dic={}
for i in df['Tags']:
    if i not in dic.keys():
        dic[i]=1
dic

In [ ]:
# 'get help c++ ': 1,
#  'get help amazon alexa ': 1,
#  'get help build chatbots with python '
# 'community random ': 1,
#  'get help r category ': 1,
#  'community suggestions; feature and course requests ': 1,
#  'community international ': 1,
# 'community getting started '
for index,row in df.iterrows():
    if row['Categories']=='get help c++ ':
        row['Categories']='get help,c++'
    if row['Categories']=='get help amazon alexa ':
        row['Categories']='get help,amazon alexa'
    if row['Categories']=='get help build chatbots with python ':
        row['Categories']='get help,build chatbots with python'
    if row['Categories']=='community random ':
        row['Categories']='community,random'
    if row['Categories']=='get help r category ':
        row['Categories']='get help,r,category'
    if row['Categories']=='community suggestions; feature and course requests ':
        row['Categories']='community suggestions,feature and course requests'
    if row['Categories']=='community international ':
        row['Categories']='community,international'
    if row['Categories']=='community getting started ':
        row['Categories']='community,getting started'

In [ ]:
df['Categories']=df['Categories'].str.replace(" ","_")

In [ ]:
df['Categories']=df['Categories'].str.replace(","," ")
df['Tags']=df['Tags'].str.replace(","," ")
df.head(50)

In [ ]:
df['labels']=df['Categories']+" "+df['Tags']
df.head(50)

In [ ]:
df2=df[['text','labels']]

In [ ]:
df2.to_csv('codechef.csv',index=False)

In [ ]:
df2.head(30)

In [ ]:
df['labels']=[i.split() for i in df['labels']]

In [ ]:
df=df[["text","Tag"]]
df.head()

                                                text                                                Tag
0             how can i prevent sql injection in php  ['php', 'mysql', 'sql', 'security', 'sql-injec...
1  when to use single quotes double quotes and ba...                         ['mysql', 'sql', 'quotes']
2  sql injection that gets around mysqlrealescape...  ['php', 'mysql', 'sql', 'security', 'sql-injec...
3  sql select only rows with max value on a colum...  ['mysql', 'sql', 'aggregate-functions', 'great...
4  simulating groupconcat mysql function in micro...  ['sql', 'sql-server', 'sql-server-2005', 'stri...

In [ ]:
df['Tags']=df['Tag'].str.strip("['")
df['Tags']=df['Tags'].str.strip("']")
df['Tags']=df['Tags'].str.replace("', '"," ")
df.head()

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

                                              Topics  ...                                               Tags
0            How can I prevent SQL injection in PHP?  ...               php mysql sql security sql-injection
1  When to use single quotes, double quotes, and ...  ...                                   mysql sql quotes
2  SQL injection that gets around mysql_real_esca...  ...               php mysql sql security sql-injection
3  SQL select only rows with max value on a colum...  ...  mysql sql aggregate-functions greatest-n-per-g...
4  Simulating group_concat MySQL function in Micr...  ...  sql sql-server sql-server-2005 string-aggregation

[5 rows x 5 columns]

In [ ]:
df = df.dropna(axis=0, subset=['Tag'])

In [ ]:
df2=df[['text','Tags']]
df2.head()

                                                text                                               Tags
0             how can i prevent sql injection in php               php mysql sql security sql-injection
1  when to use single quotes double quotes and ba...                                   mysql sql quotes
2  sql injection that gets around mysqlrealescape...               php mysql sql security sql-injection
3  sql select only rows with max value on a colum...  mysql sql aggregate-functions greatest-n-per-g...
4  simulating groupconcat mysql function in micro...  sql sql-server sql-server-2005 string-aggregation

In [ ]:
df.to_csv("/content/drive/My Drive/stacko1.csv",index=False)

In [ ]:
# df=df[['id','Topics','text','Tags']]
# df['id']=df.index
df=df[["Topics","text","Category","Tags"]]
df.head()

                                              Topics  ...                                               Tags
0            How can I prevent SQL injection in PHP?  ...               php mysql sql security sql-injection
1  When to use single quotes, double quotes, and ...  ...                                   mysql sql quotes
2  SQL injection that gets around mysql_real_esca...  ...               php mysql sql security sql-injection
3  SQL select only rows with max value on a colum...  ...  mysql sql aggregate-functions greatest-n-per-g...
4  Simulating group_concat MySQL function in Micr...  ...  sql sql-server sql-server-2005 string-aggregation

[5 rows x 4 columns]

In [ ]:
# Export output

df.to_csv('versa.csv', index=False)

In [ ]:
df['Tags']=df['Tags'].str.strip("[")
df['Tags']=df['Tags'].str.strip("]")
df.isnull().sum()

text    0
Tag     0
Tags    0
dtype: int64